{"class_name": "Model", "config": {"name": "vgg16", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments/mean", "trainable": true, "dtype": "float32", "node_def": {"name": "moments/mean", "op": "Mean", "input": ["block1_conv1/Identity", "moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments/mean", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments/StopGradient", "trainable": true, "dtype": "float32", "node_def": {"name": "moments/StopGradient", "op": "StopGradient", "input": ["moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments/StopGradient", "inbound_nodes": [[["tf_op_layer_moments/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments/SquaredDifference", "trainable": true, "dtype": "float32", "node_def": {"name": "moments/SquaredDifference", "op": "SquaredDifference", "input": ["block1_conv1/Identity", "moments/StopGradient"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments/SquaredDifference", "inbound_nodes": [[["block1_conv1", 0, 0, {}], ["tf_op_layer_moments/StopGradient", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments/variance", "trainable": true, "dtype": "float32", "node_def": {"name": "moments/variance", "op": "Mean", "input": ["moments/SquaredDifference", "moments/variance/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments/variance", "inbound_nodes": [[["tf_op_layer_moments/SquaredDifference", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments/Squeeze_1", "trainable": true, "dtype": "float32", "node_def": {"name": "moments/Squeeze_1", "op": "Squeeze", "input": ["moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, "constants": {}}, "name": "tf_op_layer_moments/Squeeze_1", "inbound_nodes": [[["tf_op_layer_moments/variance", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm/add", "op": "AddV2", "input": ["moments/Squeeze_1", "batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.000000013351432e-10}}, "name": "tf_op_layer_batchnorm/add", "inbound_nodes": [[["tf_op_layer_moments/Squeeze_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm/Rsqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm/Rsqrt", "op": "Rsqrt", "input": ["batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm/Rsqrt", "inbound_nodes": [[["tf_op_layer_batchnorm/add", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm/mul", "op": "Mul", "input": ["batchnorm/Rsqrt", "batchnorm/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm/mul", "inbound_nodes": [[["tf_op_layer_batchnorm/Rsqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "moments/Squeeze", "op": "Squeeze", "input": ["moments/mean"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments/Squeeze", "inbound_nodes": [[["tf_op_layer_moments/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm/mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm/mul_2", "op": "Mul", "input": ["moments/Squeeze", "batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm/mul_2", "inbound_nodes": [[["tf_op_layer_moments/Squeeze", 0, 0, {}], ["tf_op_layer_batchnorm/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm/mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm/mul_1", "op": "Mul", "input": ["block1_conv1/Identity", "batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm/mul_1", "inbound_nodes": [[["block1_conv1", 0, 0, {}], ["tf_op_layer_batchnorm/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm/sub", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm/sub", "op": "Sub", "input": ["batchnorm/sub/x", "batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm/sub", "inbound_nodes": [[["tf_op_layer_batchnorm/mul_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_1/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_1/mul", "op": "Mul", "input": ["block1_conv1/Identity", "batchnorm_1/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_1/mul", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm/add_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm/add_1", "op": "AddV2", "input": ["batchnorm/mul_1", "batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm/add_1", "inbound_nodes": [[["tf_op_layer_batchnorm/mul_1", 0, 0, {}], ["tf_op_layer_batchnorm/sub", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_1/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_1/add", "op": "AddV2", "input": ["batchnorm_1/mul", "batchnorm_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_1/add", "inbound_nodes": [[["tf_op_layer_batchnorm_1/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SelectV2", "trainable": true, "dtype": "float32", "node_def": {"name": "SelectV2", "op": "SelectV2", "input": ["SelectV2/condition", "batchnorm/add_1", "batchnorm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": false}}, "name": "tf_op_layer_SelectV2", "inbound_nodes": [[["tf_op_layer_batchnorm/add_1", 0, 0, {}], ["tf_op_layer_batchnorm_1/add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["tf_op_layer_SelectV2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_1/mean", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_1/mean", "op": "Mean", "input": ["block1_conv2/Identity", "moments_1/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_1/mean", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_1/StopGradient", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_1/StopGradient", "op": "StopGradient", "input": ["moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_1/StopGradient", "inbound_nodes": [[["tf_op_layer_moments_1/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_1/SquaredDifference", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_1/SquaredDifference", "op": "SquaredDifference", "input": ["block1_conv2/Identity", "moments_1/StopGradient"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_1/SquaredDifference", "inbound_nodes": [[["block1_conv2", 0, 0, {}], ["tf_op_layer_moments_1/StopGradient", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_1/variance", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_1/variance", "op": "Mean", "input": ["moments_1/SquaredDifference", "moments_1/variance/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_1/variance", "inbound_nodes": [[["tf_op_layer_moments_1/SquaredDifference", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_1/Squeeze_1", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_1/Squeeze_1", "op": "Squeeze", "input": ["moments_1/variance"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_1/Squeeze_1", "inbound_nodes": [[["tf_op_layer_moments_1/variance", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_2/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_2/add", "op": "AddV2", "input": ["moments_1/Squeeze_1", "batchnorm_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.000000013351432e-10}}, "name": "tf_op_layer_batchnorm_2/add", "inbound_nodes": [[["tf_op_layer_moments_1/Squeeze_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_2/Rsqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_2/Rsqrt", "op": "Rsqrt", "input": ["batchnorm_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_2/Rsqrt", "inbound_nodes": [[["tf_op_layer_batchnorm_2/add", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_2/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_2/mul", "op": "Mul", "input": ["batchnorm_2/Rsqrt", "batchnorm_2/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_2/mul", "inbound_nodes": [[["tf_op_layer_batchnorm_2/Rsqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_1/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_1/Squeeze", "op": "Squeeze", "input": ["moments_1/mean"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_1/Squeeze", "inbound_nodes": [[["tf_op_layer_moments_1/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_2/mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_2/mul_2", "op": "Mul", "input": ["moments_1/Squeeze", "batchnorm_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_2/mul_2", "inbound_nodes": [[["tf_op_layer_moments_1/Squeeze", 0, 0, {}], ["tf_op_layer_batchnorm_2/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_2/mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_2/mul_1", "op": "Mul", "input": ["block1_conv2/Identity", "batchnorm_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_2/mul_1", "inbound_nodes": [[["block1_conv2", 0, 0, {}], ["tf_op_layer_batchnorm_2/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_2/sub", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_2/sub", "op": "Sub", "input": ["batchnorm_2/sub/x", "batchnorm_2/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_2/sub", "inbound_nodes": [[["tf_op_layer_batchnorm_2/mul_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_3/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_3/mul", "op": "Mul", "input": ["block1_conv2/Identity", "batchnorm_3/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_3/mul", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_2/add_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_2/add_1", "op": "AddV2", "input": ["batchnorm_2/mul_1", "batchnorm_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_2/add_1", "inbound_nodes": [[["tf_op_layer_batchnorm_2/mul_1", 0, 0, {}], ["tf_op_layer_batchnorm_2/sub", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_3/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_3/add", "op": "AddV2", "input": ["batchnorm_3/mul", "batchnorm_3/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_3/add", "inbound_nodes": [[["tf_op_layer_batchnorm_3/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SelectV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "SelectV2_1", "op": "SelectV2", "input": ["SelectV2_1/condition", "batchnorm_2/add_1", "batchnorm_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": false}}, "name": "tf_op_layer_SelectV2_1", "inbound_nodes": [[["tf_op_layer_batchnorm_2/add_1", 0, 0, {}], ["tf_op_layer_batchnorm_3/add", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["tf_op_layer_SelectV2_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_2/mean", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_2/mean", "op": "Mean", "input": ["block2_conv1/Identity", "moments_2/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_2/mean", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_2/StopGradient", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_2/StopGradient", "op": "StopGradient", "input": ["moments_2/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_2/StopGradient", "inbound_nodes": [[["tf_op_layer_moments_2/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_2/SquaredDifference", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_2/SquaredDifference", "op": "SquaredDifference", "input": ["block2_conv1/Identity", "moments_2/StopGradient"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_2/SquaredDifference", "inbound_nodes": [[["block2_conv1", 0, 0, {}], ["tf_op_layer_moments_2/StopGradient", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_2/variance", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_2/variance", "op": "Mean", "input": ["moments_2/SquaredDifference", "moments_2/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_2/variance", "inbound_nodes": [[["tf_op_layer_moments_2/SquaredDifference", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_2/Squeeze_1", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_2/Squeeze_1", "op": "Squeeze", "input": ["moments_2/variance"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_2/Squeeze_1", "inbound_nodes": [[["tf_op_layer_moments_2/variance", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_4/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_4/add", "op": "AddV2", "input": ["moments_2/Squeeze_1", "batchnorm_4/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.000000013351432e-10}}, "name": "tf_op_layer_batchnorm_4/add", "inbound_nodes": [[["tf_op_layer_moments_2/Squeeze_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_4/Rsqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_4/Rsqrt", "op": "Rsqrt", "input": ["batchnorm_4/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_4/Rsqrt", "inbound_nodes": [[["tf_op_layer_batchnorm_4/add", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_4/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_4/mul", "op": "Mul", "input": ["batchnorm_4/Rsqrt", "batchnorm_4/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_4/mul", "inbound_nodes": [[["tf_op_layer_batchnorm_4/Rsqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_2/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_2/Squeeze", "op": "Squeeze", "input": ["moments_2/mean"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, "constants": {}}, "name": "tf_op_layer_moments_2/Squeeze", "inbound_nodes": [[["tf_op_layer_moments_2/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_4/mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_4/mul_2", "op": "Mul", "input": ["moments_2/Squeeze", "batchnorm_4/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_4/mul_2", "inbound_nodes": [[["tf_op_layer_moments_2/Squeeze", 0, 0, {}], ["tf_op_layer_batchnorm_4/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_4/mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_4/mul_1", "op": "Mul", "input": ["block2_conv1/Identity", "batchnorm_4/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_4/mul_1", "inbound_nodes": [[["block2_conv1", 0, 0, {}], ["tf_op_layer_batchnorm_4/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_4/sub", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_4/sub", "op": "Sub", "input": ["batchnorm_4/sub/x", "batchnorm_4/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_4/sub", "inbound_nodes": [[["tf_op_layer_batchnorm_4/mul_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_5/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_5/mul", "op": "Mul", "input": ["block2_conv1/Identity", "batchnorm_5/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_5/mul", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_4/add_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_4/add_1", "op": "AddV2", "input": ["batchnorm_4/mul_1", "batchnorm_4/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_4/add_1", "inbound_nodes": [[["tf_op_layer_batchnorm_4/mul_1", 0, 0, {}], ["tf_op_layer_batchnorm_4/sub", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_5/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_5/add", "op": "AddV2", "input": ["batchnorm_5/mul", "batchnorm_5/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_5/add", "inbound_nodes": [[["tf_op_layer_batchnorm_5/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SelectV2_2", "trainable": true, "dtype": "float32", "node_def": {"name": "SelectV2_2", "op": "SelectV2", "input": ["SelectV2_2/condition", "batchnorm_4/add_1", "batchnorm_5/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": false}}, "name": "tf_op_layer_SelectV2_2", "inbound_nodes": [[["tf_op_layer_batchnorm_4/add_1", 0, 0, {}], ["tf_op_layer_batchnorm_5/add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["tf_op_layer_SelectV2_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_3/mean", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_3/mean", "op": "Mean", "input": ["block2_conv2/Identity", "moments_3/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_3/mean", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_3/StopGradient", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_3/StopGradient", "op": "StopGradient", "input": ["moments_3/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_3/StopGradient", "inbound_nodes": [[["tf_op_layer_moments_3/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_3/SquaredDifference", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_3/SquaredDifference", "op": "SquaredDifference", "input": ["block2_conv2/Identity", "moments_3/StopGradient"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_3/SquaredDifference", "inbound_nodes": [[["block2_conv2", 0, 0, {}], ["tf_op_layer_moments_3/StopGradient", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_3/variance", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_3/variance", "op": "Mean", "input": ["moments_3/SquaredDifference", "moments_3/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_3/variance", "inbound_nodes": [[["tf_op_layer_moments_3/SquaredDifference", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_3/Squeeze_1", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_3/Squeeze_1", "op": "Squeeze", "input": ["moments_3/variance"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, "constants": {}}, "name": "tf_op_layer_moments_3/Squeeze_1", "inbound_nodes": [[["tf_op_layer_moments_3/variance", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_6/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_6/add", "op": "AddV2", "input": ["moments_3/Squeeze_1", "batchnorm_6/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.000000013351432e-10}}, "name": "tf_op_layer_batchnorm_6/add", "inbound_nodes": [[["tf_op_layer_moments_3/Squeeze_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_6/Rsqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_6/Rsqrt", "op": "Rsqrt", "input": ["batchnorm_6/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_6/Rsqrt", "inbound_nodes": [[["tf_op_layer_batchnorm_6/add", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_6/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_6/mul", "op": "Mul", "input": ["batchnorm_6/Rsqrt", "batchnorm_6/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_6/mul", "inbound_nodes": [[["tf_op_layer_batchnorm_6/Rsqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_3/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_3/Squeeze", "op": "Squeeze", "input": ["moments_3/mean"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, "constants": {}}, "name": "tf_op_layer_moments_3/Squeeze", "inbound_nodes": [[["tf_op_layer_moments_3/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_6/mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_6/mul_2", "op": "Mul", "input": ["moments_3/Squeeze", "batchnorm_6/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_6/mul_2", "inbound_nodes": [[["tf_op_layer_moments_3/Squeeze", 0, 0, {}], ["tf_op_layer_batchnorm_6/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_6/mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_6/mul_1", "op": "Mul", "input": ["block2_conv2/Identity", "batchnorm_6/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_6/mul_1", "inbound_nodes": [[["block2_conv2", 0, 0, {}], ["tf_op_layer_batchnorm_6/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_6/sub", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_6/sub", "op": "Sub", "input": ["batchnorm_6/sub/x", "batchnorm_6/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_6/sub", "inbound_nodes": [[["tf_op_layer_batchnorm_6/mul_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_7/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_7/mul", "op": "Mul", "input": ["block2_conv2/Identity", "batchnorm_7/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_7/mul", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_6/add_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_6/add_1", "op": "AddV2", "input": ["batchnorm_6/mul_1", "batchnorm_6/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_6/add_1", "inbound_nodes": [[["tf_op_layer_batchnorm_6/mul_1", 0, 0, {}], ["tf_op_layer_batchnorm_6/sub", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_7/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_7/add", "op": "AddV2", "input": ["batchnorm_7/mul", "batchnorm_7/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_7/add", "inbound_nodes": [[["tf_op_layer_batchnorm_7/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SelectV2_3", "trainable": true, "dtype": "float32", "node_def": {"name": "SelectV2_3", "op": "SelectV2", "input": ["SelectV2_3/condition", "batchnorm_6/add_1", "batchnorm_7/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": false}}, "name": "tf_op_layer_SelectV2_3", "inbound_nodes": [[["tf_op_layer_batchnorm_6/add_1", 0, 0, {}], ["tf_op_layer_batchnorm_7/add", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["tf_op_layer_SelectV2_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_4/mean", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_4/mean", "op": "Mean", "input": ["block3_conv1/Identity", "moments_4/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_4/mean", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_4/StopGradient", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_4/StopGradient", "op": "StopGradient", "input": ["moments_4/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_4/StopGradient", "inbound_nodes": [[["tf_op_layer_moments_4/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_4/SquaredDifference", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_4/SquaredDifference", "op": "SquaredDifference", "input": ["block3_conv1/Identity", "moments_4/StopGradient"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_4/SquaredDifference", "inbound_nodes": [[["block3_conv1", 0, 0, {}], ["tf_op_layer_moments_4/StopGradient", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_4/variance", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_4/variance", "op": "Mean", "input": ["moments_4/SquaredDifference", "moments_4/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_moments_4/variance", "inbound_nodes": [[["tf_op_layer_moments_4/SquaredDifference", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_4/Squeeze_1", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_4/Squeeze_1", "op": "Squeeze", "input": ["moments_4/variance"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_4/Squeeze_1", "inbound_nodes": [[["tf_op_layer_moments_4/variance", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_8/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_8/add", "op": "AddV2", "input": ["moments_4/Squeeze_1", "batchnorm_8/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.000000013351432e-10}}, "name": "tf_op_layer_batchnorm_8/add", "inbound_nodes": [[["tf_op_layer_moments_4/Squeeze_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_8/Rsqrt", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_8/Rsqrt", "op": "Rsqrt", "input": ["batchnorm_8/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_8/Rsqrt", "inbound_nodes": [[["tf_op_layer_batchnorm_8/add", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_8/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_8/mul", "op": "Mul", "input": ["batchnorm_8/Rsqrt", "batchnorm_8/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_8/mul", "inbound_nodes": [[["tf_op_layer_batchnorm_8/Rsqrt", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "moments_4/Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "moments_4/Squeeze", "op": "Squeeze", "input": ["moments_4/mean"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_moments_4/Squeeze", "inbound_nodes": [[["tf_op_layer_moments_4/mean", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_8/mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_8/mul_2", "op": "Mul", "input": ["moments_4/Squeeze", "batchnorm_8/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_8/mul_2", "inbound_nodes": [[["tf_op_layer_moments_4/Squeeze", 0, 0, {}], ["tf_op_layer_batchnorm_8/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_8/mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_8/mul_1", "op": "Mul", "input": ["block3_conv1/Identity", "batchnorm_8/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_8/mul_1", "inbound_nodes": [[["block3_conv1", 0, 0, {}], ["tf_op_layer_batchnorm_8/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_8/sub", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_8/sub", "op": "Sub", "input": ["batchnorm_8/sub/x", "batchnorm_8/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_8/sub", "inbound_nodes": [[["tf_op_layer_batchnorm_8/mul_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_9/mul", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_9/mul", "op": "Mul", "input": ["block3_conv1/Identity", "batchnorm_9/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]}}, "name": "tf_op_layer_batchnorm_9/mul", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_8/add_1", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_8/add_1", "op": "AddV2", "input": ["batchnorm_8/mul_1", "batchnorm_8/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_batchnorm_8/add_1", "inbound_nodes": [[["tf_op_layer_batchnorm_8/mul_1", 0, 0, {}], ["tf_op_layer_batchnorm_8/sub", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "batchnorm_9/add", "trainable": true, "dtype": "float32", "node_def": {"name": "batchnorm_9/add", "op": "AddV2", "input": ["batchnorm_9/mul", "batchnorm_9/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}}, "name": "tf_op_layer_batchnorm_9/add", "inbound_nodes": [[["tf_op_layer_batchnorm_9/mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SelectV2_4", "trainable": true, "dtype": "float32", "node_def": {"name": "SelectV2_4", "op": "SelectV2", "input": ["SelectV2_4/condition", "batchnorm_8/add_1", "batchnorm_9/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": false}}, "name": "tf_op_layer_SelectV2_4", "inbound_nodes": [[["tf_op_layer_batchnorm_8/add_1", 0, 0, {}], ["tf_op_layer_batchnorm_9/add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": 